
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/13611090154)



<pre><code>Error: POST https://api.github.com/repos/hayas1/coalesced/git/refs: 422 Reference already exists []

  with module.repositories[&#34;coalesced&#34;].github_repository_file.this[&#34;github/release.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/coalesced/git/refs: 422 Reference already exists []

  with module.repositories[&#34;coalesced&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["relentless"].github_repository.this: Refreshing state... [id=relentless]
module.repositories["go-fluffy-json"].github_repository.this: Refreshing state... [id=go-fluffy-json]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["coalesced"].github_repository.this: Refreshing state... [id=coalesced]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["relentless"].github_repository_ruleset.this: Refreshing state... [id=2653838]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["go-fluffy-json"].github_repository_ruleset.this: Refreshing state... [id=3439359]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["relentless"].github_branch_default.this: Refreshing state... [id=relentless]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["go-fluffy-json"].github_branch_default.this: Refreshing state... [id=go-fluffy-json]
module.repositories["coalesced"].github_branch_default.this: Refreshing state... [id=coalesced]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["relentless"].github_issue_label.this["bugfix"]: Refreshing state... [id=relentless:bugfix]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["go-fluffy-json"].github_issue_label.this["refactor"]: Refreshing state... [id=go-fluffy-json:refactor]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["go-fluffy-json"].github_issue_label.this["documentation"]: Refreshing state... [id=go-fluffy-json:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["relentless"].github_issue_label.this["deps"]: Refreshing state... [id=relentless:deps]
module.repositories["go-fluffy-json"].github_issue_label.this["breaking"]: Refreshing state... [id=go-fluffy-json:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"]: Refreshing state... [id=go-fluffy-json:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["relentless"].github_issue_label.this["feature"]: Refreshing state... [id=relentless:feature]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Refreshing state... [id=relentless:maintenance]
module.repositories["go-fluffy-json"].github_issue_label.this["deps"]: Refreshing state... [id=go-fluffy-json:deps]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["relentless"].github_issue_label.this["documentation"]: Refreshing state... [id=relentless:documentation]
module.repositories["go-fluffy-json"].github_issue_label.this["feature"]: Refreshing state... [id=go-fluffy-json:feature]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["relentless"].github_issue_label.this["breaking"]: Refreshing state... [id=relentless:breaking]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["relentless"].github_issue_label.this["refactor"]: Refreshing state... [id=relentless:refactor]
module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"]: Refreshing state... [id=go-fluffy-json:maintenance]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=go-fluffy-json/.github/release.yml]
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=relentless/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=go-fluffy-json/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=relentless/.github/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=relentless/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=go-fluffy-json/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=go-fluffy-json/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=relentless/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=go-fluffy-json/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=relentless/.github/release.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:80]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:13]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:29]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:48]
module.repositories["go-fluffy-json"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:go-fluffy-json:1]
module.repositories["relentless"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:relentless:28]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:45]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["coalesced"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"a1abad04679bd7d2c17a9d3f65f0adf1c3efb65e34e325e86478d89ba18556a9\"" -> "W/\"48cc5d0c4823028e9c090d9a27b57be8365abc30f16a3647971c089bed65d360\""
        id                          = "coalesced"
        name                        = "coalesced"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"b8f53915549aa5265686c958f31f60a09e7d7a1f011a932c51ffc03a497e069b\"" -> "W/\"54d5013b2cc1ea52c5ad0e0f06bc7cf62fc015da5c055e3d1ebca13ebb66574a\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"125ecb2da799c994ed374267ec03909893ab573c3380485f572421d1212af36e\"" -> "W/\"83a0d816d82bf2d47c5e819a4bd2dbde00f77233fec13aad4672d49adf863ab4\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["go-fluffy-json"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"3ba14f058d5b606b3748aa31c169933e27efcae2afe58686ece1553a36d5238b\"" -> "W/\"ae77ad6a856831922ea706341946e7b9fa6261cac04d249e774885a91acf671e\""
        id                          = "go-fluffy-json"
        name                        = "go-fluffy-json"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4bbbeaedae3be5f9aaee2c4ed1d1590be22d46756d6025680754b189e72bf4d7\"" -> "W/\"77266296beb5ddda34474595cb48966cc5940d6ff36836e9fe397e697eed2026\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"90e3d1e687224e52acbeb7a340419d7d398a9e1fc0584cc67a70ed4d3138466c\"" -> "W/\"53cd7e69f07dadde8583c7f05c74ecb219b15e106e4c1e2cbcc2f3b21c3993ec\""
        id                          = "relentless"
        name                        = "relentless"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"1d1898e3cbd09082412c5bf463ab341fcea52ed1aa8d6b8ba6db0d206993416a\"" -> "W/\"8c78869dcfe17fa78deb37458862b710d24af22fe5085dab5b402e428a19e704\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"3e63908ce1cc061612ff16a2ad67366d34d711c15ebd5ed71444a2d9b476328a\"" -> "W/\"f0e9941a600d9111a03b8c26c702699d9c114742d33c88042067aa02946a5bb1\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repositories["coalesced"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "coalesced"
      + url         = (known after apply)
    }

  # module.repositories["coalesced"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "coalesced"
        name                        = "coalesced"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["coalesced"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "coalesced"
      + sha                             = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "coalesced"
      + sha                             = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "coalesced"
      + sha                             = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "coalesced"
      + sha                             = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "coalesced"
      + sha                             = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "coalesced"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["coalesced"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "coalesced"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
module.repositories["coalesced"].github_repository.this: Modifying... [id=coalesced]
module.repositories["coalesced"].github_repository.this: Modifications complete after 2s [id=coalesced]
module.repositories["coalesced"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["coalesced"].github_issue_label.this["refactor"]: Creating...
module.repositories["coalesced"].github_issue_label.this["bugfix"]: Creating...
module.repositories["coalesced"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["coalesced"].github_issue_label.this["documentation"]: Creating...
module.repositories["coalesced"].github_issue_label.this["breaking"]: Creating...
module.repositories["coalesced"].github_issue_label.this["maintenance"]: Creating...
module.repositories["coalesced"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["coalesced"].github_issue_label.this["feature"]: Creating...
module.repositories["coalesced"].github_repository_ruleset.this: Creating...
module.repositories["coalesced"].github_repository_ruleset.this: Creation complete after 9s [id=3910924]
module.repositories["coalesced"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["coalesced"].github_repository_file.this["github/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["refactor"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["bugfix"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["documentation"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["breaking"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_repository_file.this["github/issue_template.md"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["maintenance"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["feature"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_repository_file.this["github/release.yml"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_issue_label.this["feature"]: Creation complete after 11s [id=coalesced:feature]
module.repositories["coalesced"].github_issue_label.this["deps"]: Creating...
module.repositories["coalesced"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["coalesced"].github_issue_label.this["documentation"]: Creation complete after 12s [id=coalesced:documentation]
module.repositories["coalesced"].github_issue_label.this["maintenance"]: Creation complete after 12s [id=coalesced:maintenance]
module.repositories["coalesced"].github_issue_label.this["bugfix"]: Creation complete after 12s [id=coalesced:bugfix]
module.repositories["coalesced"].github_issue_label.this["breaking"]: Creation complete after 12s [id=coalesced:breaking]
module.repositories["coalesced"].github_issue_label.this["refactor"]: Creation complete after 13s [id=coalesced:refactor]
module.repositories["coalesced"].github_issue_label.this["deps"]: Creation complete after 7s [id=coalesced:deps]
module.repositories["coalesced"].github_repository_file.this["github/workflows/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["coalesced"].github_repository_file.this["github/labeler.yml"]: Still creating... [20s elapsed]
module.repositories["coalesced"].github_repository_file.this["github/labeler.yml"]: Creation complete after 20s [id=coalesced/.github/labeler.yml]
module.repositories["coalesced"].github_repository_file.this["github/workflows/labeler.yml"]: Creation complete after 12s [id=coalesced/.github/workflows/labeler.yml]
module.repositories["coalesced"].github_repository_file.this["github/pull_request_template.md"]: Creation complete after 10s [id=coalesced/.github/pull_request_template.md]

Error: POST https://api.github.com/repos/hayas1/coalesced/git/refs: 422 Reference already exists []

  with module.repositories["coalesced"].github_repository_file.this["github/release.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/coalesced/git/refs: 422 Reference already exists []

  with module.repositories["coalesced"].github_repository_file.this["github/issue_template.md"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":83,"Program":"tfcmt","SHA1":"66ebbc897bdfa7f8e44200a369425a9fdfe527bd","Vars":{},"WorkflowName":"Terraform apply on push"} -->